Repository: oriadam/TableField
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: he_il

source: GO
he_il: עבור אל

source: DO
he_il: שמור

source: -- Select mode --
he_il: - בחר מצב -

source: Field class and parameters
he_il: סוג שדה ופרמטרים

source: Display order of fields +indexed? +searchable?
he_il: הצגת סדר השדות + אינדקס? + חיפוש?

source: Default sort in table
he_il: מיון ברירת מחדל של השדות בטבלה

source: Limits +null? +empty?
he_il: גבולות + null? + ריק?

source: Permissions (can be used to hide fields)
he_il: הרשאות (יכולים לשמש כדי להסתיר את השדות)

source: Fields names
he_il: שמות השדות

source: Comments and actions
he_il: הערות וקישורי פעולה

source: Database changes - edit table and fields
he_il: שינויים במסד הנתונים - עריכת, הוספת ומחיקת טבלאות ושדות

source: Select Table
he_il: בחר טבלה

source: order
he_il: סדר

source: index
he_il: אינדקס

source: search
he_il: לחפש

source: Ascending
he_il: עולה

source: Descending
he_il: יורד

source: Order by
he_il: מיון

source: Direction
he_il: כיוון מיון

source: asc
he_il: עולה

source: Delete
he_il: מחיקה

source: Add
he_il: הוספה

source: view
he_il: צפייה

source: edit
he_il: עריכה

source: add
he_il: הוספה

source: del
he_il: מחיקה

source: Table
he_il: טבלה

source: label
he_il: שם

source: action
he_il: מצב

source: Minimum
he_il: מינימום

source: Maximum
he_il: מקסימום

source: Empty
he_il: ריק

source: rename
he_il: שינוי שם

source: Sorry, you are not super user
he_il: מצטער, אתה לא סופר-יוזר

source: Action aborted - Bad file name
he_il: הפעולה בוטלה - שם הקובץ לא תקין

source: Download failed - File not found
he_il: הורדה נכשלה, הקובץ לא נמצא

source: Delete - File not found
he_il: מחיקה - הקובץ לא נמצא

source: File deleted
he_il: הקובץ נמחק

source: Unable to delete file
he_il: הקובץ מסרב להימחק

source: Zip failed - File not found
he_il: כיווץ נכשל - הקובץ לא נמצא

source: Zipped file created at
he_il: הכיווץ הצליח לקובץ

source: Unable to zip file
he_il: הכיווץ נכשל

source: Database backup created at
he_il: גיבוי מסד הנתונים הצליח לקובץ

source: Zip file created at
he_il: הכיווץ הצליח לקובץ

source: Failed mysql dump to
he_il: הגיבוי נכשל לקובץ

source: <t>/custom</t> folder is accessible to the world! This is a major security issue. Please restrict access to
he_il: אזהרת אבטחה חמורה: התיקיה <t>/custom</t> נגישה לציבור! אנא בטל את הגישה לתיקיה זו.

source: Download created files
he_il: ניהול הקבצים

source: Delete this file
he_il: למחוק את הקובץ

source: Zip it
he_il: כיווץ zip

source: Actions
he_il: פעולות

source: Backup Database
he_il: גיבוי מסד הנתונים

source: Backup Database (zip only)
he_il: גיבוי מסד הנתונים (קובץ zip בלבד)

source: Delete this file?
he_il: האם באמת למחוק את הקובץ?

source: No DB connection! Try again later, go to <A href="tfinstall.php">tfinstall.php</A> or report to administrator
he_il: אין חיבור למסד הנתונים! נסה שוב מאוחר יותר, בדוק בעמוד <A href=tfinstall.php>tfinstall.php</A> או דווח למנהל האתר

source: Adding Table
he_il: מוסיף טבלה

source: Could not detect type of
he_il: לא הצלחתי לזהות את סוג השדה

source: Adding field of class
he_il: מוסיף שדה מסוג

source: Adding meta to field
he_il: הוספת ערך מטא לשדה

source: Skipping previously added Table
he_il: מדלג על הוספת טבלה שכבר קיימת במערכת

source: This Table was not found in your database
he_il: הטבלה לא נמצאה במסד הנתונים שלך

source: Tables Wizard
he_il: אשף הוספת טבלאות

source: Quickly add existing tables to the TableField system.
he_il: הוספה בקליק של טבלאות ממסד הנתונים למערכת TableField

source: Following Field types will be detected:
he_il: שדות מהסוגים הבאים יתווספו אוטומטית:

source: primary-key, string, text, number, date/time/timestamp, enum, set <small>(=list of enums)</small>.
he_il: מפתח ראשי, טקסט, טקסט ארוך, מספר, תאריך/שעה/timestamp, enum, set (=רשימת enums).

source: When done here go to <a href=tftedit.php>TF Tables manager</a> for fine tuning of the Fields classes and meta parameters.
he_il: כשסיימתם כאן, אנא עברו <a href=tftedit.php>למנהל הטבלאות </a>TableField כדי להגדיר טוב יותר את השדות והפרמטרים שלהם.

source: For example, you may want to change a text field to html, a number to xkey, a string to email, add calculated values etc...
he_il: לדוגמא, אולי תרצה להחליף שדה מסוג טקסט-ארוך לשדה HTML, שדה מסוג מספר לסוג xkey (מפתח זר), שדה מסוג טקסט לemail, להוסיף שדות מחושבים וכן הלאה...

source: Tables currently not in TableField system
he_il: טבלאות שאינן כרגע במערכת TableField

source: Tables already in TableField system
he_il: טבלאות שכבר קיימות במערכת TableField

source: Not found in your database
he_il: לא נמצאו במסד הנתונים

source: TableField version
he_il: גרסת TableField

source: Database
he_il: מסד נתונים

source: Database name
he_il: שם מסד הנתונים

source: Backup database every X days. 0 to disable.
he_il: כל כמה ימים לגבות אוטומטית את מסד הנתונים? 0 לביטול.

source: Use the <a href=tfwizard.php>New-Tables Wizard</a> to import existing tables into TableField system
he_il: השתמשו <a href=tfwizard.php>באשף הכנסת הטבלאות</a> כדי להכניס טבלאות קיימות למערכת TableField בקליק

source: To change database connection: Remove <code>custom/dbconfig.php</code> and <code>custom/install_done</code>, then go to <a href=tfinstall.php>tfinstall.php</a>
he_il: כדי לשנות את הגדרות החיבור למסד הנתונים: הסירו את הקבצים <code>custom/dbconfig.php</code> , <code>custom/install_done</code> ועברו לעמוד <a href=tfinstall.php>tfinstall.php</a>

source: Project, HTML and display options
he_il: הגדרות הפרוייקט, תצוגה, HTML

source: Project name (html &lt;title> tag and home link)
he_il: שם הפרוייקט (וכותרת הדף)

source: Use pretty select boxes
he_il: תיבות בחירה משופרות (מומלץ)

source: Links to the top bar. One link per line.<br>Format: <code>name|link|parameters (e.g target=_blank)</code>
he_il: קישורים שיתווספו לבר העליון. קישור אחד בשורה. <br>הפורמט חשוב: <code>name|link|parameters (e.g target=_blank)</code>

source: Will be put inside the <head> tag
he_il: טקסט שיתווסף לתגית head

source: Will be put first in the <body>
he_il: טקסט HTML שיוכנס ראשון אחרי תגית body

source: Will be put last in the <body>
he_il: טקסט HTML שיוכנס אחרון בעמוד, לפני סגירת תגית body

source: Use a right-to-left UI?
he_il: לעבור לממשק מימין לשמאל?

source: URL and path locations
he_il: מיקום תיקיית TF ביחס לקבצים אחרים באתר

source: Authorization
he_il: משתמשים והרשאות

source: Allow anonymous access? Anonymous users group is <code>anonymous</code>
he_il: לאפשר כניסה לאורחים אנונימיים, ללא משתמש וסיסמה? אורחים משתייכים לקבוצה anonymous, אפשר להגדיר את ההרשאות שלהם בניהול הטבלאות.

source: Keep user always logged in as long as the browser is still open
he_il: זכור את המשתמש שהתחבר תמיד, כל עוד TableField פתוחה בדפדפן שלו.

source: User session expires after X minutes
he_il: זכור את המשתמש שהתחבר למשך X דקות.

source: Advanced and Developer options
he_il: הגדרות הפרוייקט, תצוגה, HTML

source: When updating an item report the fields that were changed.
he_il: בעדכון פריט הצג בדיוק מה השתנה בדוח הפעולות.

source: Show debug notifications? Defines PHP const DEBUG
he_il: האם להציג מידע DEBUG? שמיש לאיתור תקלות. מגדיר קבוע PHP בשם DEBUG

source: Show PHP errors and warnings? which ones? see <A href="http://php.net/errorfunc.constants" target=_blank>error_reporting() documentation</A>
he_il: אילו תקלות PHP להציג על המסך? שמיש לאיתור תקלות. לפירוט האפשרויות: <A href="http://php.net/errorfunc.constants" target=_blank>error_reporting() documentation</A>

source: Print ALL sql queries into document (printed as remarks, visible with view-source)
he_il: להדפיס למסך את כל שאילות מסד הנתונים? שמיש למציאת תקלות. השאילתות יוצגו כהערות HTML, אפשר לראות עם view source

source: Character set for HTML. Should be <code>UTF-8</code>
he_il: קידוד עבור HTML. צריך להיות <code>UTF-8</code>

source: Custom configuration keys. Values saved in PHP in $tf['<i>fieldname</i>'].<br>One line per field. Format: <code>fieldname|type|Description of the field</code><br>Available field types: <code>string,numeric,boolean,text,html,language,theme,readonly,
he_il: שדות-משתמש, מוגדרים אישית. הערכים יישמרו לקובץ ההגדרות ולמשתנה PHP הגלובלי $tf['<i>fieldname</i>']<br>. שדה אחד בשורה. הפורמט חשוב: <code>fieldname|type|Description of the field</code><br>Available field types: <code>string,numeric,boolean,text,html,language,theme,readonly,

source: Error parsing custom field - Please note the correct format. Line number:
he_il: שגיאה בעיבוד שדה-מותאם-אישית - שים לב לתבנית הנכונה. שורה מספר:

source: Error parsing custom field - Field name can only consist of abc and _. Line number:
he_il: שגיאה בעיבוד שדה-מותאם-אישית - שם השדה יכול להכיל אותיות לועזיות וקו_תחתי בלבד. שורה מספר:

source: Error parsing custom field - field key already exists. Line number:
he_il: שגיאה בעיבוד שדה-מותאם-אישית - שם השדה כבר קיים. שורה מספר:

source: Next backup time updated to
he_il: הגיבוי הבא נקבע לתאריך

source: Last backup created at
he_il: הגיבוי האחרון נערך ב-

source: Unknown Post key
he_il: מידע POST לא תקין

source: No changes made.
he_il: לא היו כל שינויים.

source: Backing up to
he_il: מגבה לקובץ

source: Save settings FAILED to
he_il: שמירת שינויים נכשלה לקובץ

source: Settings saved to
he_il: השינויים נשמרו בהצלחה לקובץ

source: Backup previous settings file
he_il: גיבוי קובץ ההגדרות הקודם

source: Change Password
he_il: שינוי סיסמה

source: Password validation doesn't match
he_il: אימות הסיסמה אינו תואם

source: Password is too easy to guess
he_il: סיסמא קלה מדי לניחוש

source: Wrong current password
he_il: סיסמא נוכחית שגויה

source: Password change failed
he_il: שינוי הסיסמה נכשל

source: Something went wrong with changing the password
he_il: משהו השתבש עם שינוי הסיסמה

source: Password changed successfully
he_il: סיסמא שונתה בהצלחה

source: Current password
he_il: סיסמא נוכחית

source: New Password
he_il: סיסמה חדשה

source: ...and again
he_il: ...ושוב

source: Change password
he_il: שנה סיסמה

source: Processing Request...
he_il: מעבד את הנתונים שהתקבלו...

source: Invalid Post Data!
he_il: תקלה בנתוני POST

source: Please copy the following data and paste to site admin
he_il: אנא העתק את הטקסט הבא והדבק בהודעה למנהל האתר

source: You are not allowed to change
he_il: אין באפשרותך לשנות את

source: Update item failed - item not found
he_il: עדכון הפריט נכשל - הפריט לא נמצא

source: Field not found in existing table. Please notify admin
he_il: השדה לא נמצא בטבלה קיימת. אנא דווח מנהל

source: Skipping unchanged value at
he_il: מדלג על שדה שלא השתנה

source: User not allowed to edit
he_il: המשתמש אינו רשאי לערוך

source: Invalid value at
he_il: הערך לא חוקי בשדה

source: Skipping unchanged set value at
he_il: מדלג על ערך מוכנס שלא השתנה בשדה

source: Skipping Array value received in POST for
he_il: מדלג על ערך מסוג Array שהתקבל

source: User is not allowed to edit
he_il: המשתמש אינו רשאי לערוך

source: Update item cancelled - nothing to update
he_il: עדכון הפריט בוטל כיוון שלא השתנה אף ערך

source: Item Partially Updated
he_il: הפריט עודכן באופן חלקי

source: Item Updated
he_il: הפריט עודכן

source: Update item failed
he_il: עדכון הפריט נכשל

source: You are not allowed to add to
he_il: אין באפשרותך להוסיף פריטים חדשים אל

source: You cannot set this const value at
he_il: אין באפשרותך להגדיר ערך קבוע-מראש לשדה

source: Invalid const value at
he_il: ערך קבוע-מראש לא תקין

source: Add item failed
he_il: הוספת הפריט נכשלה

source: New blank item added
he_il: פריט ריק חדש נוסף

source: Add blank item failed.
he_il: הוספת פריט ריק נכשלה

source: New item added with problems
he_il: נוסף פריט חדש אבל עם תקלות

source: New item added
he_il: נוסף פריט חדש

source: You are not allowed to delete from
he_il: אין באפשרותך למחוק מהטבלה

source: Nothing to remove, item not found
he_il: אין מה למחוק, הפריט לא נמצא

source: Item removed
he_il: הפריט נמחק

source: Nothing to delete
he_il: אין מה למחוק

source: Error delete item
he_il: תקלה בנסיון למחוק את הפריט

source: Finished processing request.
he_il: סוף עיבוד הנתונים שהתקבלו.

source: Bad search
he_il: חיפוש לא תקין

source: Add?
he_il: הוסף

source: Update?
he_il: עדכן?

source: View
he_il: צפייה

source: Edit
he_il: עריכה

source: Save changes
he_il: שמירת שינויים

source: Search
he_il: חיפוש

source: Log
he_il: דוח

source: Options
he_il: אפשרויות

source: Go to main menu
he_il: לתפריט הראשי

source: List layout
he_il: תצוגת רשימה

source: Boxes layout
he_il: תצוגת קופסאות

source: Switch statistics display
he_il: סטטיסטיקות

source: Statistics
he_il: סטטיסטיקות

source: Export to comma separated values file
he_il: שמירה לקובץ CSV (מופרד פסיקים)

source: Save to CSV
he_il: שמירת CSV

source: Export to tab separated values file
he_il: שמירה לקובץ TSV (מופרד טאבים)

source: Save to TSV
he_il: שמירת TSV

source: Export to semicolon separated values file
he_il: שמירה לקובץ SCSV (מופרד נקודה-פסיק)

source: Save to SCSV
he_il: שמירת SCSV

source: Full Mode
he_il: מצב רגיל

source: Full mode
he_il: מצב רגיל

source: Mini Mode
he_il: מצב מוקטן

source: Mini mode
he_il: מצב מוקטן

source: not
he_il: אינו

source: and
he_il: וגם

source: or
he_il: או

source: Quickly go to id
he_il: עבור ישירות לקוד פריט

source: Clear Search
he_il: נקה חיפוש

source: Search!
he_il: חפש!

source: Bad search method at
he_il: אפשרות החיפוש לא תקינה

source: Edit this record?
he_il: עריכת רשומה זו?

source: Edit item id
he_il: עריכת פריט

source: Update this record
he_il: עדכון רשומה זו

source: Delete this record
he_il: למחוק רשומה זו

source: Save
he_il: שמור

source: Primary key is missing or null at
he_il: ערך המפתח הראשי חסר או ריק ב

source: Copy changed values from first line to all
he_il: שכפול הערכים שהשתנו לכל השדות במסך

source: Add this record
he_il: הוספת רשומה זו

source: Add it?
he_il: להוסיף?

source: Add new items
he_il: הוסף פריטים חדשים

source: Array as value at
he_il: התקבל Array כערך בשדה

source: Total
he_il: סה''כ

source: records
he_il: פריטים

source: Show
he_il: הצג

source: per page
he_il: בעמוד

source: Titles every
he_il: כותרת כל

source: Discard Changes?
he_il: להתעלם מהשינויים שבוצעו?

source: Bad class at
he_il: סוג-שדה לא תקין הוגדר בשדה

source: Settings
he_il: הגדרות

source: TF Configuration
he_il: הגדרות TableField

source: Tables&amp;Fields screen
he_il: ניהול טבלאות-ושדות

source: TF Tables Manager
he_il: מנהל טבלאות TableField

source: TF Users screen
he_il: מנהל משתמשי TableField

source: TF Log
he_il: יומן פעילות

source: Backups
he_il: גיבויים

source: Hello,
he_il: שלום,

source: Username:
he_il: שם משתמש:

source: Group:
he_il: קבוצה:

source: Change your password
he_il: החלפת סיסמה

source: Log off
he_il: התנתק

source: User name or Email
he_il: שם משתמש או דוא''ל

source: Password
he_il: סיסמה

source: Login
he_il: כניסה

source: No results matched
he_il: אין תוצאות

source: Continue
he_il: המשך

source: Go Back
he_il: לחזור

source: Null not allowed
he_il: יש להקליד ערך אמיתי

source: Cannot be empty
he_il: יש להקליד ערך אמיתי

source: Count
he_il: כמות

source: Min
he_il: מינ'

source: Max
he_il: מקס'

source: Total Positives
he_il: כמות החיוביים

source: Total Negatives
he_il: כמות השליליים

source: Sum
he_il: סכום

source: Sum Positives
he_il: סכום החיוביים

source: Sum Negatives
he_il: סכום השליליים

source: Average
he_il: ממוצע

source: Mean Positives
he_il: ממוצע החיוביים

source: Mean Negatives
he_il: ממוצע השליליים

source: Total Empty
he_il: סה"כ ריקים

source: Median
he_il: חציוני

source: has
he_il: מכיל

source: begins with
he_il: מתחיל ב-

source: ends with
he_il: מסתיים ב-

source: is
he_il: שווה

source: is (cs)
he_il: שווה בדיוק

source: is (ci)
he_il: שווה

source: is Null
he_il: לא הוקלד

source: is True
he_il: דלוק

source: Is On
he_il: דלוק

source: is Empty
he_il: ריק

source: in
he_il: ב-

source: Value is missing at
he_il: ערך חסר ב

source: Value not in list
he_il: הערך אינו ברשימה

source: Total
he_il: סה"כ

source: Select at least one item
he_il: יש לבחור לפחות אחד

source: Has
he_il: מכיל

source: Primary key is not editable
he_il: מפתח ראשי אינו ניתן לשינוי

source: Text too long
he_il: הטקסט ארוך מידי

source: Text too short
he_il: הטקסט קצר מידי

source: Email is empty
he_il: חסר אימייל

source: Email address domain is not reachable
he_il: כתובת המייל נראית לא תקינה

source: Invalid email address
he_il: כתובת המייל לא תקינה

source: Cannot be left empty
he_il: לא יכול להשאר ריק

source: Not a number
he_il: ערך לא מספרי

source: Not supporting decimal point
he_il: אין תמיכה בשבר עשרוני

source: Number too big
he_il: מספר גדול מידי

source: Number too small
he_il: מספר קטן מידי

source: Password validation mismatched
he_il: אימות הסיסמה אינו תואם

source: Enter new password
he_il: הזן סיסמה חדשה

source: password mismatched
he_il: סיסמה לא תואמת

source: Please type current password
he_il: יש להזין את הססמה הנוכחית

source: Open full screen
he_il: פתח במסך מלא

source: Change direction (RTL/LTR)
he_il: שינוי כיוון ימין-שמאל

source: preview
he_il: תצוגה מקדימה

source: edit HTML
he_il: עריכת HTML

source: File exceeds upload_max_filesize
he_il: הקובץ גדול מהמותר

source: File exceeds MAX_FILE_SIZE
he_il: הקובץ גדול מידי

source: File was only partially uploaded
he_il: הקובץ לא נשלח עד הסוף

source: No file was uploaded
he_il: לא הועלה קובץ.

source: PHP Missing a temporary folder
he_il: למערכת PHP חסרה התיקייה הזמנית

source: File does not exist in temp folder
he_il: הקובץ לא קיים בתיקייה הזמנית

source: Error reading file size
he_il: תקלה בקריאת גודל הקובץ

source: File too big
he_il: הקובץ גדול מידי

source: File too small
he_il: הקובץ קטן מידי

source: File is empty
he_il: הקובץ ריק

source: File extension not allowed
he_il: סיומת הקובץ אינה מותרת, הקובץ לא נשמר

source: File does not exist
he_il: הקובץ לא קיים

source: No filename given
he_il: חסר שם הקובץ

source: No overwrite permission for this filename
he_il: אין הרשאת כתיבה על גבי קובץ זה

source: filename already exists
he_il: שם הקובץ כבר קיים

source: Error uploading file
he_il: תקלה בהעלאת הקובץ

source: Delete failed
he_il: תקלה במחיקה

source: delete
he_il: למחוק

source: True
he_il: חיובי

source: False
he_il: שלילי

source: Must be 1/0
he_il: חייב להיות 1 או 0

source: is On
he_il: דלוק

source: Total Yes
he_il: סה"כ חיובי

source: Total No
he_il: סה"כ שלילי

source: First
he_il: ראשון

source: Zero
he_il: אפס

source: Last
he_il: אחרון

source: Reset
he_il: הערך הקודם

source: Stars
he_il: כוכבים

source: value missing at
he_il: ערך חסר ב

source: expression not balanced at
he_il: הביטוי אינו מאוזן ב

source: not a number at
he_il: ערך לא מספרי ב

source: Cannot be null
he_il: לא יכול להיות ריק

source: Error reading data at
he_il: שגיאה במהלך קריאת הנתונים ב

source: Error reading xtable
he_il: תקלה בקריאת טבלה חיצונית

source: nothing
he_il: כלום

source: XKey not found at
he_il: פרמטר XKey חסר ב

source: value is wrong at
he_il: ערך שגוי ב

source: Delete this row
he_il: מחק שורה זו

source: Delete this row?
he_il: מחק שורה זו?

source: Done. Save changes to edit the new parameter.
he_il: בוצע. שמור את השינויים כדי לערוך את הפרמטר החדש.

source: Add param
he_il: הוספת פרמטר

source: Only SELECT queries allowed at
he_il: שאילתת שדה חישוב חייבת להיות מסוג SELECT בשדה

source: Error with calculated query at
he_il: תקלה בהרצת שאילתת חישוב בשדה

source: QUERY ERROR
he_il: תקלה בשאילתה
